// Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

Console.WriteLine("Введите число дня недели: ");
int namber = int.Parse(Console.ReadLine());

if(namber == 1)

{
    Console.WriteLine($"нет");
}

    if(namber == 2)
    
    {
        Console.WriteLine($"нет");
    }  

        if(namber == 3)

        {
            Console.WriteLine($"нет");   
        }

            if(namber == 4)

            {
                Console.WriteLine($"нет");
            }

                if(namber == 5)

                {
                    Console.WriteLine($"нет");
                }

                    if(namber == 6)

                    {
                        Console.WriteLine($"да");
                    }

                        if(namber == 7)

                        {
                            Console.WriteLine($"да");
                        }